/*******************************************************************************************************************************
 * Project : BOOT
 * Module  : BOOT\Hardware\MD_Bms
 * File    : md_bms_rec_data_proc.c
 * Date    : 2026-09-20
 * Author  : LJD(291483914@qq.com)
 * Desc    : BMS 接收数据解析与状态装载实现
 * -------------------------------------------------------
 * todo    :
 * 1. 无
 * -------------------------------------------------------
 * Copyright (c) 2026 -inc
 *******************************************************************************************************************************/

//****************************************************Includes******************************************************************//
#include "MD_Bms/md_bms_rec_data_proc.h"

#if (boardBMS_EN)
#include "Print/print_task.h"
#include "Baiku/baiku_proto.h"

//****************************************************Function Declaration******************************************************//


/***********************************************************************************************************************
 * 函数功能    : 处理接收到的数据
 * 说明(备注)  : none
 * 传入参数    : proto: 接收协议包指针
 * 输出参数    : none
 * 返回值      : 0: 没有错误, 其他有错误
 ************************************************************************************************************************/
s8 c_bms_rec_proc_data(BaikuProtoRx_t *proto)
{
	s8 ret = 0;

	if (uPrint.tFlag.bBmsRecTask)
	{
		sMyPrint("bBmsRecTask:指令:0x%x, 数据:", proto->ucCmd);
		for (int i = 0; i < proto->ucValidLen; i++)
			sMyPrint("%x ", proto->ucpValidData[i]);
		sMyPrint("\r\n");
	}
	
	switch (proto->ucCmd)
    {
		default:
		{
			ret = -99;
		}
		break;
	}

	return ret;
}

#endif  /* boardBMS_EN */
