/*******************************************************************************************************************************
 * Project : BOOT
 * Module  : BOOT\Application\Sys
 * File    : sys_queue_task_reset.c
 * Date    : 2026-09-20
 * Author  : LJD(291483914@qq.com)
 * Desc    : 系统软件复位队列任务实现
 * -------------------------------------------------------
 * todo    :
 * 1. none
 * -------------------------------------------------------
 * Copyright (c) 2026 -inc
 *******************************************************************************************************************************/

//****************************************************Includes******************************************************************//
#include "Sys/sys_queue_task.h"
#include "Sys/sys_task.h"
#include "Print/print_task.h"

#if (1)
//****************************************************Macros********************************************************************//

//****************************************************Parameter Initialization**************************************************//

//****************************************************Function Declaration******************************************************//


/***********************************************************************************************************************
 * 函数功能    : 系统复位任务执行函数
 * 说明(备注)  : 触发内核复位 NVIC_SystemReset
 * 传入参数    : tp_task: 队列任务控制块指针
 * 输出参数    : 无
 * 返回值      : 无
 ************************************************************************************************************************/
void v_sys_queue_task_reset(Task_T *tp_task)
{
    switch (tp_task->ucStep)
    {
        case 0:
        {
            cQueue_GotoStep(tp_task, STEP_NEXT);
        }
        break;

        case 1:
        {
            NVIC_SystemReset();
        }
        break;

        default:
        {
            cQueue_GotoStep(tp_task, STEP_END);
        }
        break;
    }

    /* 等待 5S 超时保护 */
    if (bQueue_IsStepTimeout(tp_task, (5000 / sysTASK_CYCLE_TIME)) && tp_task->ucStep != STEP_END)
    {
        if (uPrint.tFlag.bSysTask)
            log_w("bSysTask:设置重置任务等待超时,退出");
        cQueue_GotoStep(tp_task, STEP_END);
    }
}

#endif  /* 1 */
