/*******************************************************************************************************************************
 * Project : BOOT
 * Module  : BOOT\Application\Sys
 * File    : sys_queue_task_dispaly.c
 * Date    : 2026-09-20
 * Author  : LJD(291483914@qq.com)
 * Desc    : 系统显示管理队列任务实现
 * -------------------------------------------------------
 * todo    :
 * 1. none
 * -------------------------------------------------------
 * Copyright (c) 2026 -inc
 *******************************************************************************************************************************/

//****************************************************Includes******************************************************************//
#include "Sys/sys_queue_task.h"

#if (boardDISPLAY_EN)
#include "Print/print_task.h"

#if (1)
//****************************************************Macros********************************************************************//

//****************************************************Parameter Initialization**************************************************//

//****************************************************Function Declaration******************************************************//


/***********************************************************************************************************************
 * 函数功能    : 系统显示队列任务函数
 * 说明(备注)  : 驱动显示模式步骤
 * 传入参数    : p_task: 队列任务控制块指针
 * 输出参数    : 无
 * 返回值      : 无
 ************************************************************************************************************************/
void v_sys_queue_task_disp(Task_T *p_task)
{
    switch (p_task->ucStep)
    {
        case 0:
        {
            cQueue_GotoStep(p_task, STEP_NEXT);
        }
        break;

        case 1:
        {
            cQueue_GotoStep(p_task, STEP_END);
        }
        break;

        default:
        {
            cQueue_GotoStep(p_task, STEP_END);
        }
        break;
    }

    /* 步骤超时保护 */
    if (bQueue_IsStepTimeout(p_task, (10000 / sysTASK_CYCLE_TIME)) && p_task->ucStep != STEP_END)
    {
        if (uPrint.tFlag.bSysTask)
            log_w("bSysTask:显示任务等待超时,退出");
        cQueue_GotoStep(p_task, STEP_END);
    }
}

#endif  /* 1 */
#endif  /* boardDISPLAY_EN */
