/*****************************************************************************************************************
*                                                                                                                *
 *                                         系统的队列函数                                                  		*
*                                                                                                                *
******************************************************************************************************************/
#include "Sys/sys_queue_task.h"

#if(boardDISPLAY_EN)
#include "Print/print_task.h"

/***********************************************************************************************************************
-----函数功能    系统关闭中
-----说明(备注)  none
-----传入参数    none
-----输出参数    none
-----返回值      none
************************************************************************************************************************/  
void v_sys_queue_task_disp(Task_T *tp_task)
{
    switch (tp_task->ucStep)
    {
		//************************************步骤零:上报控制台关闭**********************************************
		case 0:
		{
//			cQueue_GotoStep( tp_task, STEP_NEXT );  //下一步
		}break ;
		
		
		//************************************步骤2:关闭BMS**********************************************
		case 1:
		{
			cQueue_GotoStep(tp_task, STEP_END);
		}
		break ;
		
		default:
			cQueue_GotoStep(tp_task, STEP_END);
			break;
    }
	
//	//初始化等待10S,超时退出
//	tp_task->usTaskWaitCnt++;
//	if(tp_task->usTaskWaitCnt > (10000/sysTASK_CYCLE_TIME) && tp_task->ucStep != STEP_END)
//	{
//		if(uPrint.tFlag.bSysTask)
//			log_w("bSysTask:设置充电功率任务等待超时,退出");
//		
//		cQueue_GotoStep( tp_task, STEP_END );  //结束
//	}
}
#endif
