
#ifndef FREERTOS_CONFIG_H
#define FREERTOS_CONFIG_H

#if  defined(__ICCARM__) || defined(__CC_ARM) || defined(__TASKING__) || defined(__GNUC__)
#include <stdint.h>
extern uint32_t SystemCoreClock;
#endif

#include "board_config.h"

// <<< Use Configuration Wizard in Context Menu >>>
//=============================================================================================================
//================================================基础配置选项=================================================
//=============================================================================================================
//<h>        	基础配置选项
//-------------------------------------------------------------------
//          	<q0> 内核工作模式选择
//                                          			<i> 勾选为开启
#define 		configUSE_PREEMPTION					 1 
//<i> 1:使用抢先式内核,即当进程位于内核空间时，有一个更高优先级的任务出现时，
//<i>	如果当前内核允许抢占，则可以将当前任务挂起，执行优先级更高的进程；
//<i> 0:为合作轮转内核
//-------------------------------------------------------------------
//          	<o0> CPU时钟频率
#define 		configCPU_CLOCK_HZ                   	 (SystemCoreClock)
//<i> 	单位: Hz, 无默认需定义
//-------------------------------------------------------------------
//                                         				<1-1000><i>
//          	<o0> 时钟节拍频率
#define 		configTICK_RATE_HZ						 1000
//<i> 	当SysTick时钟频率与内核时钟频率不同时才可以定义.
//<i> 	单位: Hz, 默认: 不定义
//-------------------------------------------------------------------
//          	<o0> 最大优先级数
//                                         				<1-32><i>
#define 		configMAX_PRIORITIES					 8
//<i>	最大优先级=configMAX_PRIORITIES-1, 越大越高, 无默认需定义
//-------------------------------------------------------------------
//          	<o0> 空闲任务的堆栈大小
//                                         				<1-1000><i>
#define 		configMINIMAL_STACK_SIZE				 128
//<i>	单位:Word = 4byte, 无默认需定义
//-------------------------------------------------------------------
//          	<o0> 任务名最大字符数
#define 		configMAX_TASK_NAME_LEN					 16
//<i>	
//-------------------------------------------------------------------
//          	<q0> 节拍计数器的数据类型
#define 		configUSE_16_BIT_TICKS					 0
//<i> 0:系统节拍计数器的数据类型为 32 为无符号整型
//<i> 1:系统节拍计数器的数据类型为 16 位无符号整形
//<i>定义系统时钟节拍计数器的数据类型为16位无符号数, 无默认需定义.
//<i>使用16位类型将大大提高8位和16位架构的性能，但将最大可指定时间限制为65535个“ticks”.
//<i>因此，假设节拍频率为250Hz，当使用16位计数器时，(1/250)*65535=262,
//<i>任务可以延迟或阻塞的最大时间为262秒，而使用32位计数器时为17179869秒。
//-------------------------------------------------------------------
//          	<o0> 在抢占式调度下,同优先级的任务能抢占空闲任务
//                                         				<1-32><i>
#define 		configIDLE_SHOULD_YIELD					 1
//<i> 0:阻止空闲任务为用户任务让出CPU，直到空闲任务的时间片结束。
//<i> 1:默认,在抢占调度下，同等优先级的任务可抢占空闲任务，
//<i>	并延用空闲任务剩余的时间片;
//-------------------------------------------------------------------
//          	<q0> 任务间直接的消息传递
#define 		configUSE_TASK_NOTIFICATIONS		 	 1
//<i> 1:默认,消息传递包括信号量、事件标志组和消息邮箱,
//<i>	当开启任务通 知功能后，每个任务将多占用 8 字节的内存空间.
//-------------------------------------------------------------------
//          	<o0> 务通知数组的大小
#define 		configTASK_NOTIFICATION_ARRAY_ENTRIES	 1
//<i> 1:默认,定义任务通知数组的大小
//-------------------------------------------------------------------
//          	<q0> 使能互斥信号量
#define 		configUSE_MUTEXES						 1
//<i> 0:默认
//-------------------------------------------------------------------
//          	<q0> 使能递归互斥信号量
#define 		configUSE_RECURSIVE_MUTEXES				 1
//<i> 0:默认
//-------------------------------------------------------------------
//          	<q0> 使能计数信号量
#define 		configUSE_COUNTING_SEMAPHORES			 0
//<i> 0:默认
//-------------------------------------------------------------------
//</h>       	基础配置选项

//=============================================================================================================
//============================================内存分配相关定义=================================================
//=============================================================================================================
//<h>        	内存分配
//-------------------------------------------------------------------
//          	<q0> 使能静态申请内存
#define 		configSUPPORT_STATIC_ALLOCATION			 0
//<i> 0:默认
//<i> 1:FreeRTOS支持使用静态方式管理内存.
//<i>	用户还需要提供两个回调函数:vApplicationGetIdleTaskMemory() 
//<i>	和vApplicationGetTimerTaskMemory().
//-------------------------------------------------------------------
//          	<q0> 使能动态申请内存
#define 		configSUPPORT_DYNAMIC_ALLOCATION		 1
//<i> 1:默认,FreeRTOS 支持使用动态方式管理内存.
//-------------------------------------------------------------------
//          	<o0> 总的堆栈大小
#define 		configTOTAL_HEAP_SIZE					 ((size_t)(30 * 1024))
//<i>	RTOS动态内存管理的内存大小(RAM总量)，即RTOS的内存堆，单位为 Byte
//-------------------------------------------------------------------
//          	<q0> 使能手动分配RTOS内存堆(ucHeap).
#define 		configAPPLICATION_ALLOCATED_HEAP		 0
//<i> 0:默认,FreeRTOS 的内存堆将由编译器进行分配。
//<i> 1:用户需要自行创建FreeRTOS的内存堆
//<i>	利用此宏定义，可以使用 FreeRTOS 动态管理外扩内存。
//-------------------------------------------------------------------
//          	<q0> 使能用户自行实现任务创建时使用的内存申请与释放函数
#define 		configSTACK_ALLOCATION_FROM_SEPARATE_HEAP 0
//<i> 0:默认,
//<i> 1:此宏用于自定义动态创建和删除任务时，任务栈内存的申请与释放函数
//<i>	pvPortMallocStack()和vPortFreeStack().
//<i>	用户需提供 pvPortMallocStack()和 vPortFreeStack()函数。
//-------------------------------------------------------------------
//</h>       	内存分配


//=============================================================================================================
//===============================================低功耗管理相关配置=============================================
//=============================================================================================================
//<h>        	低功耗管理
extern void PreSleepProcessing(uint32_t ulExpectedIdleTime);
extern void PostSleepProcessing(uint32_t ulExpectedIdleTime);
#define configPRE_SLEEP_PROCESSING PreSleepProcessing    //进入低功耗模式前要做的处理
#define configPOST_SLEEP_PROCESSING PostSleepProcessing  //退出低功耗模式后要做的处理
//-------------------------------------------------------------------
//          	<q0> 使能低功耗Tickless模式
#define 		configUSE_TICKLESS_IDLE					 0
//<i> 0:默认
//<i> 1:启用低功耗 tickless 模式
//-------------------------------------------------------------------
//          	<o0> 低功耗模式的时钟节拍数
#define 		configEXPECTED_IDLE_TIME_BEFORE_SLEEP	 2000
//<i>	只有当系统可运行于低功耗模式的时钟节拍数大于等于这个参数时，系统才可以进入到低功耗模式
//-------------------------------------------------------------------
//</h>       	低功耗管理


//=============================================================================================================
//============================================钩子函数的相关定义===============================================
//=============================================================================================================
//<h>        	钩子函数
//-------------------------------------------------------------------
//          	<q0> 使能空闲任务钩子函数
#define 		configUSE_IDLE_HOOK						 1
//<i> 0:默认
//<i> 1:需自己实现vApplicationIdleHook
//-------------------------------------------------------------------
//          	<q0> 使能系统时钟节拍中断钩子函数
#define 		configUSE_TICK_HOOK						 0
//<i> 0:默认
//<i> 1:需自己实现vApplicationTickHook
//-------------------------------------------------------------------
//          	<q0> 使能选择栈溢出检测方法
#define 		configCHECK_FOR_STACK_OVERFLOW			 0
//<i> 2:使用栈溢出检测方法二
//<i> 1:使用栈溢出检测方法一
//<i> 0:默认
//-------------------------------------------------------------------
//          	<q0> 使能动态内存申请失败钩子函数
#define 		configUSE_MALLOC_FAILED_HOOK			 0
//<i> 0:默认
//<i> 1:使能使用动态内存分配失败钩子函数,需自定义相关钩子函数
//-------------------------------------------------------------------
//          	<q0> 使能定时器服务任务首次执行前的钩子函数
#define 		configUSE_DAEMON_TASK_STARTUP_HOOK		 0                      
//<i> 0:默认
//<i> 1:使能使用定时器服务任务首次执行前的钩子函数,
//<i> 	需自定义相关钩子函数
//-------------------------------------------------------------------
//</h>       	钩子函数

#if(boardUSE_OS_DEBUG_OUT)
//=============================================================================================================
//====================================运行时间和任务状态统计相关定义===========================================
//=============================================================================================================
//<h>        	运行时间和任务状态统计
//-------------------------------------------------------------------
//          	<q0> 使能运行时间统计功能
#define 		configGENERATE_RUN_TIME_STATS			 0
//<i> 0:默认
//<i> 1:使能任务运行时间统计功能,此时用户需要提供两个函数，
//<i> 	一个是用于配置任务运行时间统计功能的函数portCONFIGURE_TIMER_FOR_RUN_TIME_STATS()，
//<i> 	一般是完成定时器的初始化，
//<i> 	另一个函数是portGET_RUN_TIME_COUNTER_VALUE()，
//<i> 	该函数用于获取定时器的计时值
//-------------------------------------------------------------------
//          	<q0> 使能可视化追踪功能
#define 		configUSE_TRACE_FACILITY				 1
//<i> 0:默认
//<i> 1:该配置通常在调试时才会使用，在真正发布程序时必须将其关闭，
//<i> 	因为其对于FreeRTOS的性能是有影响的
//-------------------------------------------------------------------
//          	<q0> 使能编译vTaskList()和vTaskGetRunTimeStats()
#define 		configUSE_STATS_FORMATTING_FUNCTIONS	 1  
//<i> 0:默认
//<i> 1:会编译vTaskList()和vTaskGetRunTimeStats()函数
//-------------------------------------------------------------------
//          	<q0> 使能获取指定任务的Tag
#define 		configUSE_APPLICATION_TASK_TAG			 0
//<i> 0:默认
//<i>	返回与任务关联的“标签”值。标签值的含义和用途 由应用程序编写者定义。
//<i>	RTOS 内核本身通常不会 访问标签值此功能仅适用于高级用户，一般较少用到
//-------------------------------------------------------------------
//          	<q0> 使能获取堆栈使用情况
#define 		INCLUDE_uxTaskGetStackHighWaterMark		 1
//<i> 0:默认
//-------------------------------------------------------------------
//          	<o0> 定义可以注册的队列和信号量的最大数量
#define 		configQUEUE_REGISTRY_SIZE				 0
//<i> 0:默认
//<i> n:在使用内核调试器查看信号量和队列的时候需要设置此宏，
//<i>	而且要先将消息队列和信号量进行注册，只有注册了的队列和信号量才会再内核调试器中看到，
//<i>	如果不使用内核调试器的话此宏设置为 0 即可。
//-------------------------------------------------------------------
//</h>       	运行时间和任务状态统计
#endif  //boardUSE_OS_DEBUG_OUT


//=============================================================================================================
//=========================================软件定时器相关配置==================================================
//=============================================================================================================
//<h>        	软件定时器
//-------------------------------------------------------------------
//          	<q0> 使能软件定时器
#define 		configUSE_TIMERS					 	 1
//<i> 0:默认
//-------------------------------------------------------------------
//          	<o0> 定义软件定时器任务的优先级
#define 		configTIMER_TASK_PRIORITY				 7
//<i> 	软件定时器的优先级 越大越高
//-------------------------------------------------------------------
//          	<o0> 定义软件定时器命令队列的长度
#define 		configTIMER_QUEUE_LENGTH				 10
//<i> 	软件定时器的开启、停止与销毁等操作都是通过队列实现的
//-------------------------------------------------------------------
//          	<o0> 定义软件定时器任务的栈空间大小
#define 		configTIMER_TASK_STACK_DEPTH			 (configMINIMAL_STACK_SIZE * 5)
//<i>	单位: Word, 无默认,configUSE_TIMERS为1需定义
//-------------------------------------------------------------------
//</h>       	软件定时器


//=============================================================================================================
//===============================================协程相关配置==================================================
//=============================================================================================================
//<h>        	协程相关配置
//-------------------------------------------------------------------
//          	<q0> 使能协程
#define 		configUSE_CO_ROUTINES					 0
//<i> 0:默认
//<i> 1:协程是一种轻量级的任务模型，适用于资源极其受限的嵌入式系统（如RAM小于2KB的MCU）。
//<i>特性		协程（Co-routines）		普通任务（Tasks）
//<i>栈空间		所有协程共享一个栈		每个任务独立栈
//<i>调度方式	协作式（需主动让出 CPU）	可抢占式或协作式
//<i>内存占用	极低（适合资源紧缺设备）	较高（每个任务需独立栈）
//<i>实时性		较低（依赖手动调度）		高（支持优先级抢占）
//<i>适用场景	简单逻辑、低速控制		复杂逻辑、实时控制
//<i>必须同时实现协程调度器（通常在main.c中调用 vCoRoutineSchedule()）。
//-------------------------------------------------------------------
//          	<o0> 协程优先级数量（至少1）
#define 		configMAX_CO_ROUTINE_PRIORITIES			 2
//-------------------------------------------------------------------
//</h>       	协程相关配置

//=============================================================================================================
//===============================================API函数接口相关配置============================================
//=============================================================================================================
//<h>        	API函数接口相关配置
//-------------------------------------------------------------------
//          	<q0> 设置任务的优先级
#define 		INCLUDE_vTaskPrioritySet				 1
//-------------------------------------------------------------------
//          	<q0> 获取某个任务的优先级
#define 		INCLUDE_uxTaskPriorityGet				 1
//-------------------------------------------------------------------
//          	<q0> 删除任务
#define 		INCLUDE_vTaskDelete						 1
//-------------------------------------------------------------------
//          	<q0> 可以回收删除任务后的资源
#define 		INCLUDE_vTaskCleanUpResources        	 0
//-------------------------------------------------------------------
//          	<q0> 将指定任务设置为挂起
#define 		INCLUDE_vTaskSuspend					 1
//-------------------------------------------------------------------
//          	<q0> 任务会进入阻塞状态
#define 		INCLUDE_vTaskDelayUntil					 1
//-------------------------------------------------------------------
//          	<q0> 可用于固定频率的延时，它用来延时一个绝对时间
#define 		INCLUDE_vTaskDelay 						 1
//-------------------------------------------------------------------
//</h>       	API函数接口相关配置

// <<< end of configuration section >>>

//=============================================================================================================
//===============================================Cortex-M特性相关配置=========================================
//=============================================================================================================
//<i>在NVIC分组4情况下，抢占优先级范围0-15，数值越小，级别越高，即0代表最高，15代表最低.
//<i>FreeRTOS中,数值越小，级别越低，即0代表最低，15代表最大.
//-------------------------------------------------------------------
//          	<o0> 设置优先级的Bit数量
#ifdef 			__NVIC_PRIO_BITS
    #define 	configPRIO_BITS							 __NVIC_PRIO_BITS
#else
    #define 	configPRIO_BITS							 4        /* 15 priority levels */
#endif

/*========================================== SysTick中断优先级配置 ============================================*/
//<i>Cortex-M内核使用8bit来配置优先级，但是STM32只使用了高4bit，数值越小，优先级越高。
//<i>在往寄存器里面写数值配置的时候，是按照8bit来写的，所以真正写的时候需要经过转换，公式为：
//<i>((priority << (8 - __NVIC_PRIO_BITS)) & 0xff)，其中的priority就是我们配置的真正的优先级
//-------------------------------------------------------------------
//          	<o0> 可以使用的最低中断优先级
#define 		configLIBRARY_LOWEST_INTERRUPT_PRIORITY	 0xf
//-------------------------------------------------------------------
//          	<o0> 设置FreeRTOS内核本身使用的中断优先级
#define 		configKERNEL_INTERRUPT_PRIORITY			 (configLIBRARY_LOWEST_INTERRUPT_PRIORITY<<(8 - configPRIO_BITS))
//<i>因为FreeRTOS内核中断（PendSV中断和SysTick中断）不允许抢占用户使用的中断，
//<i>所以这个宏一般定义为硬件最低优先级。对于STM32F103而言，硬件最低优先级为15，
//<i>因此configKERNEL_INTERRUPT_PRIORITY=255。
//<i>这个255和中断优先级=15怎么联系起来 呢？
//<i>STM32F1xx和F4xx只使用了这个8位中的高四位[7:4]作为中断优先级，低四位无任何意义一般填充1。
//<i>因此255=1111 1111B，高4位的1111B=0x0F=15。

//<i>目的：设置内核中断的优先级，确保它们在系统中具有最低的优先级。这允许其他中断抢占内核的时钟中断，这在实时系统中通常是需要的。
//<i>使用：这个值通常设置为最低的优先级。在 ARM Cortex-M 微控制器中，这可能设置为最高的数值（例如，对于 8 位优先级字段，可能是 255）。
//-------------------------------------------------------------------

/*=======================================可屏蔽的中断优先级配置====================================================*/
//-------------------------------------------------------------------
//          	<o0> 设置FreeRTOS API函数可以调用的最高中断优先级.
#define 		configLIBRARY_MAX_SYSCALL_INTERRUPT_PRIORITY 2

//-------------------------------------------------------------------
//          	<o0> 设置中断服务程序中调用中断安全的FreeRTOS API函数的最高中断优先级
#define 		configMAX_SYSCALL_INTERRUPT_PRIORITY	 (configLIBRARY_MAX_SYSCALL_INTERRUPT_PRIORITY<<(8 - configPRIO_BITS))
//<i>不可以设置为0
//<i>RTOS中断嵌套方案将有效的中断优先级分成两组：一组可以通过RTOS临界区屏蔽，另一组不受RTOS影响，
//<i>configMAX_SYSCALL_INTERRUPT_PRIORITY是两组中断的分界点，优先级高于分界点点的不受RTOS的控制.
//<i>例如,LIBRARY设置为2时候,2~15的中断中都可以调用FreeRTOS的IAP函数,
//<i>nvic_irq_enable(XX,2,0)可以,但是nvic_irq_enable(XX,1,0)中调用IAP就会报错.

//<i>目的:确保FreeRTOS内核的关键部分不会被更高优先级的中断打断，
//<i>		这些中断可能会调用 FreeRTOS API 函数，从而导致竞态条件或数据损坏。
//<i>使用:当配置一个中断时，如果该中断处理程序会调用 FreeRTOS API 函数，
//<i>		那么它的优先级应该设置为小于或等于 configMAX_SYSCALL_INTERRUPT_PRIORITY。
//-------------------------------------------------------------------


//=============================================================================================================
//===============================FreeRTOS接口中断句柄映射到CMSIS的标准命名中===================================
//=============================================================================================================
#define 		vPortSVCHandler 					SVC_Handler
#define 		xPortPendSVHandler 					PendSV_Handler
#define 		xPortSysTickHandler					SysTick_Handler


#include "board_config.h"
#if boardSEGGER
#define 		INCLUDE_xTaskGetIdleTaskHandle			 1
#define 		INCLUDE_pxTaskGetStackStart				 1
#endif

/* normal assert() semantics without relying on the provision of an assert.h header file */
#define configASSERT( x )                              if( ( x ) == 0 ) { taskDISABLE_INTERRUPTS(); for( ;; ); } 

#endif /* FREERTOS_CONFIG_H */
