/*****************************************************************************************************************
*                                                                                                                *
 *                                         独立看门口                                                           *
*                       时钟源来自于内部低速时钟。所以即使主时钟失效，亦能保证产生复位。但计数精度不高。            *
*                       时钟源来自于内部低速时钟IRC40K,待机和深度睡眠模式也可工作                                  *
******************************************************************************************************************/

#include "fwdgt.h"

#if(boardWDGT_EN)

/*****************************************************************************************************************
-----函数功能    看门口初始化
-----说明(备注)  none
-----传入参数    none
-----输出参数    none
-----返回值      none
*****************************************************************************************************************/
void vFwdgt_Init(void)
{
  uint16_t timeout_t=0xFFFFU;
	/* enable IRC40K */
  rcu_osci_on(RCU_IRC40K);
	
	/* wait till IRC40K is ready */
  while(SUCCESS != rcu_osci_stab_wait(RCU_IRC40K))
  {
	if(timeout_t > 0) timeout_t--;
	else			  break;
  }
	
  /* configure FWDGT counter clock: 40KHz(IRC40K)  / 128 = 0.312 KHz */
  fwdgt_config(2*500,FWDGT_PSC_DIV128);				 //t = (1/0.312)x(2x500) = 3.2s
	
  fwdgt_write_disable();
  /* After 1.6 seconds to generate a reset */
  fwdgt_enable();
}


/*****************************************************************************************************************
-----函数功能    喂狗
-----说明(备注)  可以在任何地方喂狗,没有时间区间限制
-----传入参数    none
-----输出参数    none
-----返回值      none
*****************************************************************************************************************/
void vFwdgt_Reload(void)
{
	/* uncock fwdgt write protect*/
	fwdgt_write_enable();
	/* feed fwdgt */
	fwdgt_counter_reload();	
}


/*****************************************************************************************************************
-----函数功能    看门狗进入低功耗
-----说明(备注)  喂狗间隔改为最大26S
-----传入参数    none
-----输出参数    none
-----返回值      none
*****************************************************************************************************************/
void vFwdgt_EnterLowPower(void)
{
	vFwdgt_Reload();
  /* configure FWDGT counter clock: 40KHz(IRC40K)  / 256 = 0.156 KHz */
  fwdgt_config(0xfff,FWDGT_PSC_DIV256);				 //t = 26S
	
  fwdgt_write_disable();
  /* After 1.6 seconds to generate a reset */
  fwdgt_enable();
}


/*****************************************************************************************************************
-----函数功能    看门狗退出低功耗
-----说明(备注)  none
-----传入参数    none
-----输出参数    none
-----返回值      none
*****************************************************************************************************************/
void vFwdgt_ExitLowPower(void)
{
	vFwdgt_Reload();
    vFwdgt_Init();
}


#endif










