/*******************************************************************************************************************************
 * Project : BOOT
 * Module  : BOOT\Application
 * File    : timer_task.c
 * Date    : 2026-09-20
 * Author  : LJD(291483914@qq.com)
 * Desc    : 软件定时器任务周期调度实现
 * -------------------------------------------------------
 * todo    :
 * 1. none
 * -------------------------------------------------------
 * Copyright (c) 2026 -inc
 *******************************************************************************************************************************/

//****************************************************Includes******************************************************************//
#include "timer_task.h"
#include "Sys/sys_task.h"

#if (boardCONSOLE_EN)
#include "MD_Console/md_console_rec_task.h"
#endif  /* boardCONSOLE_EN */

#if (boardWDGT_EN)
#include "fwdgt.h"
#endif  /* boardWDGT_EN */

//****************************************************Macros********************************************************************//

//****************************************************Parameter Initialization**************************************************//
static vu8 timer_cnt = 0;

//****************************************************Function Declaration******************************************************//


/***********************************************************************************************************************
 * 函数功能    : 软件定时器任务周期调度
 * 说明(备注)  : 依据boardREPET_TIMER_CYCLE_TMIE周期递增计数器并触发1秒级节拍任务
 * 传入参数    : 无
 * 输出参数    : 无
 * 返回值      : 无
 ************************************************************************************************************************/
void vTimer_Task(void)
{
	timer_cnt++;
	if (timer_cnt >= (1000 / boardREPET_TIMER_CYCLE_TMIE)) //1S计时 
	{
		timer_cnt = 0;
		vSys_TickTimer();
		
		#if (boardWDGT_EN && boardPRINT_IFACE == 0)
		vFwdgt_Reload();
		#endif  /* boardWDGT_EN && boardPRINT_IFACE == 0 */
		
		#if (boardENG_MODE_EN)
		vEng_ExitEngModeCnt();
		#endif  /* boardENG_MODE_EN */
	}
	
	#if (boardCONSOLE_EN)
//	vConsole_RecTickTimer();
	#endif  /* boardCONSOLE_EN */
	
//	#if (boardMPPT_EN)
//	vMPPT_RecTickTimer();
//	#endif
}

#if (boardLOW_POWER)
/***********************************************************************************************************************
 * 函数功能    : 定时器进入低功耗处理
 * 说明(备注)  : 重置计数变量
 * 传入参数    : 无
 * 输出参数    : 无
 * 返回值      : 无
 ************************************************************************************************************************/
void vCount_EnterLowPower(void)
{
	timer_cnt = 0;
}

/***********************************************************************************************************************
 * 函数功能    : 定时器退出低功耗处理
 * 说明(备注)  : 重置计数变量
 * 传入参数    : 无
 * 输出参数    : 无
 * 返回值      : 无
 ************************************************************************************************************************/
void vCount_ExitLowPower(void)
{
	timer_cnt = 0;
}
#endif  /* boardLOW_POWER */
