/*******************************************************************************************************************************
 * Project : APP
 * Module  : APP\Hardware\Dc
 * File    : dc_iface.c
 * Date    : 2026-09-20
 * Author  : LJD(291483914@qq.com)
 * Desc    : DC 底层硬件接口驱动实现文件
 * -------------------------------------------------------
 * todo    :
 * 1. 无
 * -------------------------------------------------------
 * Copyright (c) 2026 -inc
 *******************************************************************************************************************************/

//****************************************************Includes******************************************************************//
#include "Dc/dc_iface.h"

#if (boardDC_EN)

//****************************************************Function Declaration******************************************************//
static void v_dc_gpio_init(void);

//****************************************************Function Declaration******************************************************//

/***********************************************************************************************************************
 * 函数功能    : DC 相关 IO 初始化
 * 说明(备注)  : 配置 DC 使能引脚推挽输出，默认初始化为关闭状态
 * 传入参数    : 无
 * 输出参数    : 无
 * 返回值      : 无
 ************************************************************************************************************************/
static void v_dc_gpio_init(void)
{
	rcu_periph_clock_enable(dcPOWER_EN_RCU);
	#if (boardIC_TYPE == boardIC_GD32F50X)
	gpio_mode_set(dcPOWER_EN_PORT, GPIO_MODE_OUTPUT, GPIO_PUPD_NONE, dcPOWER_EN_PIN);
	gpio_output_options_set(dcPOWER_EN_PORT, GPIO_OTYPE_PP, GPIO_OSPEED_LEVEL0, dcPOWER_EN_PIN);
	#else
	gpio_init(dcPOWER_EN_PORT, GPIO_MODE_OUT_PP, GPIO_OSPEED_2MHZ, dcPOWER_EN_PIN);
	#endif  /* boardIC_TYPE */
	dcPOWER_EN_OFF();
}

/***********************************************************************************************************************
 * 函数功能    : DC 接口初始化
 * 说明(备注)  : 完成底层 GPIO 初始化
 * 传入参数    : 无
 * 输出参数    : 无
 * 返回值      : 无
 ************************************************************************************************************************/
void vDc_IfaceInit(void)
{
	v_dc_gpio_init();
}

#endif  /* boardDC_EN */
