/*******************************************************************************************************************************
 * Project : APP
 * Module  : APP\Hardware\Dc
 * File    : dc_queue_task_shut_down.c
 * Date    : 2026-09-20
 * Author  : LJD(291483914@qq.com)
 * Desc    : DC 队列任务: 关机完成实现文件
 * -------------------------------------------------------
 * todo    :
 * 1. 无
 * -------------------------------------------------------
 * Copyright (c) 2026 -inc
 *******************************************************************************************************************************/

//****************************************************Includes******************************************************************//
#include "Dc/dc_queue_task.h"

#if (boardDC_EN)
#include "Dc/dc_task.h"
#include "Dc/dc_iface.h"
#include "Sys/sys_task.h"
#include "Print/print_task.h"

#if (boardUSE_OS)
#include "freertos.h"
#include "task.h"
#endif  /* boardUSE_OS */

//****************************************************Function Declaration******************************************************//

/***********************************************************************************************************************
 * 函数功能    : DC 队列任务: 关机完成
 * 说明(备注)  : 阻塞等待新任务投递(开机/保护命令)，唤醒后交还调度
 * 传入参数    : p_task: 队列任务控制块
 * 输出参数    : 无
 * 返回值      : 无
 ************************************************************************************************************************/
void v_dc_queue_task_shut_down(Task_T *p_task)
{
	vDc_SetWorkState(DS_SHUT_DOWN);
	dcPOWER_EN_OFF();

	/* 等待任务通知 一直等待, 直到释放通知 */
	#if (boardUSE_OS)
	ulTaskNotifyTake(pdTRUE, portMAX_DELAY);
	#endif  /* boardUSE_OS */

	cQueue_GotoStep(p_task, STEP_END);
}

#endif  /* boardDC_EN */
